<?php
/*
| -------------------------------------------------------------------
| Foreign Characters
| -------------------------------------------------------------------
| This file contains an array of foreign characters for transliteration
| conversion used by the Text helper
|
*/
class ForeignCharacters {
	public static $transliteration = array(
		'/ü/' => 'ue',
		'/Ä/' => 'Ae',
		'/Ü/' => 'Ue',
		'/Ö/' => 'Oe',
		'/À|Á|Â|Ã|Ä|Å/' => 'A',
		'/à|á|â|ã|å|ª/' => 'a',
		'/Ç/' => 'C',
		'/ç/' => 'c',
		'/Ğ|Ğ/' => 'D',
		'/ğ/' => 'd',
		'/È|É|Ê|Ë/' => 'E',
		'/è|é|ê|ë/' => 'e',
		'/Ì|Í|Î|Ï/' => 'I',
		'/ì|í|î|ï/' => 'i',
		'/Ñ/' => 'N',
		'/ñ/' => 'n',
		'/Ò|Ó|Ô|Õ|Ø/' => 'O',
		'/ò|ó|ô|õ|ø|º/' => 'o',
		'/Ù|Ú|Û/' => 'U',
		'/ù|ú|û/' => 'u',
		'/İ/' => 'Y',
		'/ı|ÿ/' => 'y',
		'/Æ/' => 'AE',
		'/ß/'=> 'ss'
	);
}
